socialNetwork/wrk2/custom-scripts/outputs-without-istio/rps_100/4
Running 1m test @ http://128.199.25.250:31111/wrk2-api/home-timeline/read
  2 threads and 100 connections
  Thread calibration: mean lat.: 93.397ms, rate sampling interval: 553ms
  Thread calibration: mean lat.: 93.773ms, rate sampling interval: 553ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    64.50ms   33.44ms 180.74ms   79.13%
    Req/Sec    49.72     39.89    90.00     67.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   59.68ms
 75.000%   77.89ms
 90.000%  100.35ms
 99.000%  180.74ms
 99.900%  281.60ms
 99.990%  287.23ms
 99.999%  287.23ms
100.000%  287.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.823     0.000000            1         1.00
      30.783     0.100000          499         1.11
      39.231     0.200000          997         1.25
      46.399     0.300000         1497         1.43
      53.407     0.400000         1994         1.67
      59.679     0.500000         2493         2.00
      63.167     0.550000         2745         2.22
      66.239     0.600000         2992         2.50
      69.119     0.650000         3245         2.86
      72.959     0.700000         3494         3.33
      77.887     0.750000         3739         4.00
      80.511     0.775000         3865         4.44
      82.879     0.800000         3988         5.00
      86.143     0.825000         4113         5.71
      89.471     0.850000         4237         6.67
      93.759     0.875000         4362         8.00
      95.551     0.887500         4425         8.89
     100.351     0.900000         4486        10.00
     104.191     0.912500         4549        11.43
     108.735     0.925000         4611        13.33
     112.063     0.937500         4673        16.00
     114.431     0.943750         4704        17.78
     117.695     0.950000         4735        20.00
     124.031     0.956250         4766        22.86
     128.319     0.962500         4798        26.67
     134.399     0.968750         4829        32.00
     138.111     0.971875         4845        35.56
     141.311     0.975000         4860        40.00
     147.455     0.978125         4875        45.71
     152.063     0.981250         4894        53.33
     160.255     0.984375         4908        64.00
     163.071     0.985938         4914        71.11
     166.271     0.987500         4922        80.00
     176.383     0.989062         4930        91.43
     181.375     0.990625         4938       106.67
     252.671     0.992188         4946       128.00
     261.759     0.992969         4949       142.22
     267.775     0.993750         4953       160.00
     270.079     0.994531         4958       182.86
     273.407     0.995313         4961       213.33
     275.455     0.996094         4966       256.00
     275.711     0.996484         4968       284.44
     275.967     0.996875         4970       320.00
     276.223     0.997266         4972       365.71
     277.247     0.997656         4974       426.67
     278.015     0.998047         4975       512.00
     278.783     0.998242         4976       568.89
     281.087     0.998437         4977       640.00
     281.599     0.998633         4980       731.43
     281.599     0.998828         4980       853.33
     281.599     0.999023         4980      1024.00
     281.599     0.999121         4980      1137.78
     282.879     0.999219         4981      1280.00
     282.879     0.999316         4981      1462.86
     284.927     0.999414         4982      1706.67
     284.927     0.999512         4982      2048.00
     284.927     0.999561         4982      2275.56
     285.695     0.999609         4983      2560.00
     285.695     0.999658         4983      2925.71
     285.695     0.999707         4983      3413.33
     285.695     0.999756         4983      4096.00
     285.695     0.999780         4983      4551.11
     287.231     0.999805         4984      5120.00
     287.231     1.000000         4984          inf
#[Mean    =       64.501, StdDeviation   =       33.444]
#[Max     =      286.976, Total count    =         4984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5902 requests in 1.00m, 1.55MB read
Requests/sec:     98.33
Transfer/sec:     26.50KB